app/controllers/friends_controller.rb

INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["friend_id", 0], ["user_id", 1], ["created_at", "2016-08-10 18:47:53.353863"], ["updated_at", "2016-08-10 18:47:53.353863"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
  def create
  	@friendship = User.find(session[:user_id]).friendships.create(:friend_id => params[:friend_id])

DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 6]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT 1  [["user_id", 3], ["friend_id", 2]]
---
	def destroy
		@friendship = Friendship.find_by(user_id: session[:user_id], friend_id: params[:friend_id]).destroy