app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."first_name" = ? AND "users"."last_name" = ? LIMIT 1  [["first_name", "jim"], ["last_name", "rhoades"]]
---
	def create
			user = User.find_by(first_name: params[:first_name], last_name: params[:last_name])