app/controllers/users_controller.rb

  def show
     @user = User.all
     @users = User.find(params[:id])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "joe"], ["last_name", "smith"], ["created_at", "2016-08-04 17:13:06.918602"], ["updated_at", "2016-08-04 17:13:06.918602"]]

  def delete_show
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @user = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]